podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/DeviceData/Device.SVD/Internal/peripherals/FTM1_MK82F25615.svd.xml
            <register>
               <name>PWMLOAD</name>
               <description>FTM PWM Load</description>
               <addressOffset>0x98</addressOffset>
               <fields>
                  <field>
                     <name>CH0SEL</name>
                     <description>Channel 0 Select</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Do not include channel in the matching process</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Include channel in the matching process</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="CH0SEL" > <name>CH1SEL</name> <description>Channel 1 Select</description> <bitOffset>1</bitOffset> </field>
                  <field derivedFrom="CH0SEL" > <name>CH2SEL</name> <description>Channel 2 Select</description> <bitOffset>2</bitOffset> </field>
                  <field derivedFrom="CH0SEL" > <name>CH3SEL</name> <description>Channel 3 Select</description> <bitOffset>3</bitOffset> </field>
                  <field derivedFrom="CH0SEL" > <name>CH4SEL</name> <description>Channel 4 Select</description> <bitOffset>4</bitOffset> </field>
                  <field derivedFrom="CH0SEL" > <name>CH5SEL</name> <description>Channel 5 Select</description> <bitOffset>5</bitOffset> </field>
                  <field derivedFrom="CH0SEL" > <name>CH6SEL</name> <description>Channel 6 Select</description> <bitOffset>6</bitOffset> </field>
                  <field derivedFrom="CH0SEL" > <name>CH7SEL</name> <description>Channel 7 Select</description> <bitOffset>7</bitOffset> </field>
                  <field>
                     <name>LDOK</name>
                     <description>Load Enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Loading updated values is disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Loading updated values is enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
